<a href="https://colab.research.google.com/github/arora-786/Social-Media-Analytics/blob/main/Assessment.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

**Sample Data**

In [1]:
data = 'Airline Code;DelayTimes;FlightCodes;To_From\nAir Canada (!);[21, 40];20015.0;WAterLoo_NEWYork\n<Air France> (12);[];;Montreal_TORONTO\n(Porter Airways. );[60, 22, 87];20035.0;CALgary_Ottawa\n12. Air France;[78, 66];;Ottawa_VANcouvER\n""".\\.Lufthansa.\\.""";[12, 33];20055.0;london_MONTreal\n'

**Importing Required Libraries**

In [2]:
import pandas as pd
from io import StringIO 
import numpy as np
import string

**Converting Data Into Pandas DataFrame**

In [3]:
df = pd.read_csv(StringIO(data), sep=";")
df.head()

         Airline Code    DelayTimes  FlightCodes           To_From
0      Air Canada (!)      [21, 40]      20015.0  WAterLoo_NEWYork
1   <Air France> (12)            []          NaN  Montreal_TORONTO
2  (Porter Airways. )  [60, 22, 87]      20035.0    CALgary_Ottawa
3      12. Air France      [78, 66]          NaN  Ottawa_VANcouvER
4   ".\.Lufthansa.\."      [12, 33]      20055.0   london_MONTreal

**Checking Rows & Columns In The Dataset**

In [4]:
df.shape

(5, 4)

The dataset has 5 rows and 4 columns.
<br><br>
### Part 1


*   Filling in missing values in 'FlightCodes' column
*   Converting 'FlightCodes' column into integer type

In [5]:
# converting to integer type
df['FlightCodes'] = df[['FlightCodes']].fillna(0).astype(int)

In [6]:
"""
This block fills in the missing values in 'FlightCodes' column.

This approach is taken keeping in view all the scenarios that
might occur.

Cases taken into consideration are:
1. [20015, nan, 20035, nan, 20055]
2. [nan, nan, 20035, nan, 20055]
3. [20015, nan, 20035, nan, nan]
4. [nan, nan, 20035, nan, nan]

And likewise many other possible permutation and combinations.

Only assumption taken here is that there will be at least one flight
code present in the column.
"""
for idx, val in enumerate(df['FlightCodes']):
  if val != 0:
    value = val
    val_index = idx
    break

codes = list(df['FlightCodes'])
for code in codes:
  if code == 0:
    null_index = codes.index(code)
    codes[null_index] = value + 10*(null_index - val_index)

print('Flight codes after filling in missing values')
print(codes)

# Updating Column
df['FlightCodes'] = codes

Flight codes after filling in missing values
[20015, 20025, 20035, 20045, 20055]

In [7]:
df.head()

         Airline Code    DelayTimes  FlightCodes           To_From
0      Air Canada (!)      [21, 40]        20015  WAterLoo_NEWYork
1   <Air France> (12)            []        20025  Montreal_TORONTO
2  (Porter Airways. )  [60, 22, 87]        20035    CALgary_Ottawa
3      12. Air France      [78, 66]        20045  Ottawa_VANcouvER
4   ".\.Lufthansa.\."      [12, 33]        20055   london_MONTreal

### Part 2


*   Split 'To_From' column into 2 columns
*   Canvert values into capital case

In [8]:
df[['To', 'From']] = df['To_From'].str.split('_', expand=True)
df['To'] = df['To'].apply(str.capitalize)
df['From'] = df['From'].apply(str.capitalize)
df['To_From'] = df['To_From'].apply(str.capitalize)

In [9]:
# 'To_From' column not dropped for the purpose of verification
df.head()

         Airline Code    DelayTimes  ...        To       From
0      Air Canada (!)      [21, 40]  ...  Waterloo    Newyork
1   <Air France> (12)            []  ...  Montreal    Toronto
2  (Porter Airways. )  [60, 22, 87]  ...   Calgary     Ottawa
3      12. Air France      [78, 66]  ...    Ottawa  Vancouver
4   ".\.Lufthansa.\."      [12, 33]  ...    London   Montreal

[5 rows x 6 columns]

### Part 3


*   Remove punctuations from 'Airline Code' column except spaces

In [10]:
def clean_data(airline_code):
  return str.strip("".join([char for char in airline_code if char not in string.punctuation]))

In [11]:
df['Airline Code'] = df['Airline Code'].apply(clean_data)
df.head()

     Airline Code    DelayTimes  ...        To       From
0      Air Canada      [21, 40]  ...  Waterloo    Newyork
1   Air France 12            []  ...  Montreal    Toronto
2  Porter Airways  [60, 22, 87]  ...   Calgary     Ottawa
3   12 Air France      [78, 66]  ...    Ottawa  Vancouver
4       Lufthansa      [12, 33]  ...    London   Montreal

[5 rows x 6 columns]

### Part 4


*   Mock SQL query to find all flights leaving from Waterloo

`SELECT
   FlightCodes
FROM df
WHERE LOWER(From) == 'waterloo';
`

**Explanation:** <br>df is the table name and we are converting the 'From' column to lower case because in general data can be any case.<br> So to avoid any error, we convert the values to lower case and then equate it with the required value.